// Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.

Console.WriteLine("Введите число N");
int n = Convert.ToInt32(Console.Readline());
int summ (int n)
{
  int n = 0;
  for (int i = 1; i <= n; i++)
  {
    summ = i+ summ;
  }
return (summ);
}

